Revit 2027 API
SlabShapeEditor.SlabShapeCreases Property
All of the creases that can be edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SlabShapeCreaseArray SlabShapeCreases { get; }
Public ReadOnly Property SlabShapeCreases As SlabShapeCreaseArray
	Get
public:
property SlabShapeCreaseArray^ SlabShapeCreases {
	SlabShapeCreaseArray^ get ();
}
member SlabShapeCreases : SlabShapeCreaseArray with get
Property Value
SlabShapeCreaseArray
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace